{
  "description": "<p><strong>Type</strong> Armor</p><p><strong>Parts</strong> The monster must have a reaction, free action, or passive ability that deals piercing or slashing damage (currently impossible to automate as).</p><hr><p><strong>Effect</strong> You imbue the armor with vicious spikes.</p><ul><li><strong>2nd</strong> The armor gains the following activation:<br><strong>Activate</strong> 2 Interact<br><strong>Frequency</strong> once per day<br><strong>Effect</strong> You cause vicious spikes to protrude from the armor. For 1 minute, adjacent creatures that hit you with a melee attack, as well as creatures that touch you or hit you with an unarmed attack, take 1 piercing damage each time they do. If they Grab or Grapple you, the damage increases to 1d4 piercing damage instead.</li><li><strong>4th</strong> The damage from the activation increases to 1d4, or 2d4 when creatures Grab or Grapple you.</li><li><strong>6th</strong> The damage from the activation increases to 1d6, or 2d6 when creatures Grab or Grapple you.</li><li><strong>8th</strong> The damage from the activation increases to 2d4, or 4d4 when creatures Grab or Grapple you.</li><li><strong>10th</strong> The damage from the activation increases to 2d6, or 4d6 when creatures Grab or Grapple you.</li><li><strong>12th</strong> The armor's activation gains a frequency of once per hour instead of once per day. Even when it isn't activated, adjacent creatures that hit you with a melee attack, as well as creatures that touch you or hit you with an unarmed attack, take 1 piercing damage each time they do. If they Grab or Grapple you, the damage increases to 1d4 piercing damage instead. When activated, the damage from the activation increases this damage; they aren't cumulative.</li><li><strong>14th</strong> The damage from the activation increases to 3d6, or 6d6 when creatures Grab or Grapple you.</li><li><strong>16th</strong> The armor's activation takes only a single action, instead of two actions.</li><li><strong>18th</strong> The damage from the activation increases to 4d6, or 8d6 when creatures Grab or Grapple you. The damage when the armor isn't activated increases to 1d4, or 2d4 when creatures Grab or Grapple you.</li><li><strong>20th</strong> The armor's activation gains a frequency of once per 10 minutes instead of once per hour. Furthermore, in addition to its one action activation, the armor can be activated as a reaction triggered when a creature Grabs or successfully Grapples you. When you activate the armor in this way, the triggering creature takes the increased damage from the armor. This usage is still subject to the armor's frequency of once per 10 minutes.</li></ul>",
  "flavor": "You imbue the armor with vicious spikes.",
  "label": "Spiked"
}